In [1]:
import gzip
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
#read zip file into a dataframe
imdb_titles_df = pd.read_csv('zippedData/imdb.title.akas.csv.gz')
imdb_titles_df.head() #preview file

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [6]:
imdb_titles_df.shape # 331,703 records and 8 rowns
imdb_titles_df.columns

Index(['title_id', 'ordering', 'title', 'region', 'language', 'types',
       'attributes', 'is_original_title'],
      dtype='object')

### Title_ID Data

title_id looks to be a unique identifier for each movie-- not each release. The title is different depending on languages, but the title_id is the unifier of all these ids.

In [10]:
imdb_titles_df['title_id'].isnull().sum() #0 null records
len(imdb_titles_df['title_id'].unique()) #122,302 unique titles
imdb_titles_df['title_id'].value_counts() #shows how many releases essentially a groupby

tt2488496    61
tt1201607    55
tt2310332    55
tt2278871    53
tt2948356    53
             ..
tt3297060     1
tt6984930     1
tt5950850     1
tt6951594     1
tt2522328     1
Name: title_id, Length: 122302, dtype: int64

### ordering data

In [29]:
len(imdb_titles_df['ordering'].unique()) #61 unique values
ordering_list = imdb_titles_df['ordering'].unique()
print(np.sort(ordering_list)) # confirmed a list of 1-61.. this means at least 1 film was released up to 61 times
imdb_titles_df['ordering'].isnull().sum() # 0 null values

[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24
 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48
 49 50 51 52 53 54 55 56 57 58 59 60 61]

0

Not completely sure, but this ordering seems to be the order of release. If it is the original release then it will start at 1 and as it is released other times it increments up by 1.

### Title Data

In [32]:
imdb_titles_df['title'].isnull().sum() # 0 null values

0

This column does not provide much value in my opinion. The title_id is the more important part and we can then use the region data/ordering rather than the title. It is in many different languages so there are too many character variations.

### Region Data

In [47]:
regions = imdb_titles_df['region']
region_values = imdb_titles_df['region'].value_counts() #213 values 
regions_unique = imdb_titles_df['region'].unique() #214 values

regions.isnull().sum() # 53,293 null values

#difference in values to unique must be the null values not being counted in value_counts. With 53,293 it would be the first item in the list.
region_values

US      51490
XWW     18467
RU      13817
DE      11634
FR      10990
        ...
XNA         1
CF          1
AI          1
CSHH        1
SB          1
Name: region, Length: 213, dtype: int64

### Language Data

In [ ]:
language = imdb_titles_df['language']
language_values = imdb_titles_df['language'].value_counts() #213 values
language_unique = imdb_titles_df['language'].unique() #214 values